# -*- coding: utf-8 -*-
# -*- mode: org -*-

#+TITLE: Companion Material README
#+AUTHOR: Bruno Alves et al.

#+STARTUP: overview indent

* Introduction

This is the companion repository for the paper entitled *Introducing a color correction method to reduce noise on plant phenology metrics*, by Bruno da Silva Alves, Bruna Alberton, Patricia Morellato and Lucas Mello Schnorr.

** Requirements
This companion material is written in the R programming language, and
all the scripts make heavy use of the [[https://www.tidyverse.org/][tidyverse]]. In order to reproduce
the work contained in this repository, both environments should be
installed. We also use the [[https://cran.r-project.org/web/packages/colorspace/vignettes/colorspace.html#installation][colorspace]] library for color palette
manipulation. 
This work was tested in the following R environment:

#+BEGIN_SRC R :results output :exports both
options(crayon.enabled = FALSE)
library(tidyverse)
library(arrow)
library(patchwork)

sessionInfo()
#+END_SRC

#+RESULTS:
#+begin_example
R version 4.1.1 (2021-08-10)
Platform: x86_64-apple-darwin20.6.0 (64-bit)
Running under: macOS Big Sur 11.5.2

Matrix products: default
BLAS:   /usr/local/Cellar/openblas/0.3.18/lib/libopenblasp-r0.3.18.dylib
LAPACK: /usr/local/Cellar/r/4.1.1_1/lib/R/lib/libRlapack.dylib

locale:
[1] pt_BR.UTF-8/pt_BR.UTF-8/pt_BR.UTF-8/C/pt_BR.UTF-8/pt_BR.UTF-8

attached base packages:
[1] stats     graphics  grDevices utils     datasets  methods   base     

other attached packages:
 [1] patchwork_1.1.1 arrow_5.0.0     forcats_0.5.1   stringr_1.4.0  
 [5] dplyr_1.0.7     purrr_0.3.4     readr_2.0.1     tidyr_1.1.3    
 [9] tibble_3.1.3    ggplot2_3.3.5   tidyverse_1.3.1

loaded via a namespace (and not attached):
 [1] Rcpp_1.0.7       cellranger_1.1.0 pillar_1.6.2     compiler_4.1.1  
 [5] dbplyr_2.1.1     tools_4.1.1      bit_4.0.4        jsonlite_1.7.2  
 [9] lubridate_1.7.10 lifecycle_1.0.0  gtable_0.3.0     pkgconfig_2.0.3 
[13] rlang_0.4.11     reprex_2.0.1     cli_3.0.1        rstudioapi_0.13 
[17] DBI_1.1.1        haven_2.4.3      xml2_1.3.2       withr_2.4.2     
[21] httr_1.4.2       fs_1.5.0         generics_0.1.0   vctrs_0.3.8     
[25] hms_1.1.0        bit64_4.0.5      grid_4.1.1       tidyselect_1.1.1
[29] glue_1.4.2       R6_2.5.1         fansi_0.5.0      readxl_1.3.1    
[33] tzdb_0.1.2       modelr_0.1.8     magrittr_2.0.1   backports_1.2.1 
[37] scales_1.1.1     ellipsis_0.3.2   rvest_1.0.1      assertthat_0.2.1
[41] colorspace_2.0-2 utf8_1.2.2       stringi_1.7.3    munsell_0.5.0   
[45] broom_0.7.9      crayon_1.4.1    
#+end_example

